app/views/repos/show.html.erb


    <% @repo.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."repo_id" = ?  [["repo_id", 1]]