app/views/courses/show.html.erb


  <% if @course.posts.count == 0 %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = ?  [["course_id", 1]]

        <div><h5 class = "course_title"> <%= link_to "#{post.category+'-'+post.title}", course_post_path(post.course, post), :class => "post_link" %></h5></div>
        <div>Posted by user: <strong><%= link_to "#{@users.find(post.user_id).user_name}", users_profile_path(@users.find(post.user_id)), :class => "post_links"%> </strong></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]