app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <strong><%= @post.category %></strong> post, by user:
      <%=@users.find(@post.user_id).user_name%>