app/controllers/courses_controller.rb

    def show
        @posts = Post.all
        # Get course
        @course = Course.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = ?  [["course_id", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def search
        @course = Course.find_by(name: (params[:search]).upcase)

        if @course
            @users = User.all
            render "show"
        else
            @courses = Course.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."name" = ? LIMIT ?  [["name", "ECE444"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses"