app/controllers/items_controller.rb

SELECT "repos".* FROM "repos" WHERE "repos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("url", "name", "description", "created_at", "updated_at", "repo_id") VALUES (?, ?, ?, ?, ?, ?)  [["url", "ur 1"], ["name", "item 1"], ["description", "des 1"], ["created_at", "2019-11-08 20:33:31.289285"], ["updated_at", "2019-11-08 20:33:31.289285"], ["repo_id", 1]]
---
    def create
        @repo = Repo.find(params[:repo_id])
        @item = @repo.items.create(item_params)

SELECT "repos".* FROM "repos" WHERE "repos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."repo_id" = ? AND "items"."id" = ? LIMIT ?  [["repo_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]
---
    def destroy
        @repo = Repo.find(params[:repo_id])
        @item = @repo.items.find(params[:id])
        @item.destroy