app/controllers/posts_controller.rb

    def new
        @post = Post.new
        @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @course = Course.find(params[:course_id])
        @post = @course.posts.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = ? AND "posts"."id" = ? LIMIT ?  [["course_id", 1], ["id", 5], ["LIMIT", 1]]

    def create
        @course = Course.find(params[:course_id])

        # Add current user id to the hash
        post_params_2 = post_params
        post_params_2[:user_id] = current_user.id

        @post = @course.posts.create(post_params_2)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "category", "created_at", "updated_at", "user_id", "course_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "asdd"], ["description", "asdsd"], ["category", "Tutoring"], ["created_at", "2019-11-07 03:20:30.640693"], ["updated_at", "2019-11-07 03:20:30.640693"], ["user_id", 1], ["course_id", 1]]

    def update
        @course = Course.find(params[:course_id])
        @post = @course.posts.find(params[:id])

        # Add current course and user id to the hash
        post_params_2 = post_params
        post_params_2[:course_id] = @course.id
        post_params_2[:user_id] = current_user.id

        if @post.update(post_params_2)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "post 3"], ["description", "yooo"], ["category", "Studymate"], ["updated_at", "2019-11-07 04:19:44.034220"], ["id", 4]]

    def show
        @course = Course.find(params[:course_id])
        @post = @course.posts.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def destroy
        @course = Course.find(params[:course_id])
        @post = @course.posts.find(params[:id])
        @post.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]