app/controllers/repos_controller.rb

    def index
        @repos = Repo.all
---
SELECT "repos".* FROM "repos"

    def show
        @repo = Repo.find(params[:id])
---
SELECT "repos".* FROM "repos" WHERE "repos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @repo = Repo.new(repo_params)
        if @repo.save
---
INSERT INTO "repos" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asd"], ["description", "asd"], ["created_at", "2019-11-06 23:43:04.087520"], ["updated_at", "2019-11-06 23:43:04.087520"]]

    def destroy
        @repo = Repo.find(params[:id])
        @repo.destroy
---
SELECT "repos".* FROM "repos" WHERE "repos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "repos" WHERE "repos"."id" = ?  [["id", 2]]